OpenAtomFoundation/TobudOS/platform/vendor_bsp/gd/GD32F1x0_Firmware_Library_v3.1.0/GD32F1x0_standard_peripheral/Include/gd32f1x0_usart.h
/*!
    \file  gd32f1x0_usart.h
    \brief definitions for the USART
*/

/*
    Copyright (C) 2017 GigaDevice

    2014-12-26, V1.0.0, platform GD32F1x0(x=3,5)
    2016-01-15, V2.0.0, platform GD32F1x0(x=3,5,7,9)
    2016-04-30, V3.0.0, firmware update for GD32F1x0(x=3,5,7,9)
    2017-06-19, V3.1.0, firmware update for GD32F1x0(x=3,5,7,9)
*/

#ifndef GD32F1X0_USART_H
#define GD32F1X0_USART_H

#include "gd32f1x0.h"

/* USARTx(x=0,1) definitions */
#define USART0                        (USART_BASE + 0x0000F400U)
#define USART1                        USART_BASE

/* registers definitions */
#define USART_CTL0(usartx)            REG32((usartx) + 0x00U)        /*!< USART control register 0 */
#define USART_CTL1(usartx)            REG32((usartx) + 0x04U)        /*!< USART control register 1 */
#define USART_CTL2(usartx)            REG32((usartx) + 0x08U)        /*!< USART control register 2 */
#define USART_BAUD(usartx)            REG32((usartx) + 0x0CU)        /*!< USART baud rate register */
#define USART_GP(usartx)              REG32((usartx) + 0x10U)        /*!< USART guard time and prescaler register */
#define USART_RT(usartx)              REG32((usartx) + 0x14U)        /*!< USART receiver timeout register */
#define USART_CMD(usartx)             REG32((usartx) + 0x18U)        /*!< USART command register */
#define USART_STAT(usartx)            REG32((usartx) + 0x1CU)        /*!< USART status register */
#define USART_INTC(usartx)            REG32((usartx) + 0x20U)        /*!< USART status clear register */
#define USART_RDATA(usartx)           REG32((usartx) + 0x24U)        /*!< USART receive data register */
#define USART_TDATA(usartx)           REG32((usartx) + 0x28U)        /*!< USART transmit data register */

/* bits definitions */
/* USARTx_CTL0 */
#define USART_CTL0_UEN                BIT(0)       /*!< USART enable */
#define USART_CTL0_UESM               BIT(1)       /*!< USART enable in deep-sleep mode */
#define USART_CTL0_REN                BIT(2)       /*!< receiver enable */
#define USART_CTL0_TEN                BIT(3)       /*!< transmitter enable */
#define USART_CTL0_IDLEIE             BIT(4)       /*!< idle line detected interrupt enable */
#define USART_CTL0_RBNEIE             BIT(5)       /*!< read data buffer not empty interrupt and overrun error interrupt enable */
#define USART_CTL0_TCIE               BIT(6)       /*!< transmission complete interrupt enable */
#define USART_CTL0_TBEIE              BIT(7)       /*!< transmitter register empty interrupt enable */
#define USART_CTL0_PERRIE             BIT(8)       /*!< parity error interrupt enable */
#define USART_CTL0_PM                 BIT(9)       /*!< parity mode */
#define USART_CTL0_PCEN               BIT(10)      /*!< parity control enable */
#define USART_CTL0_WM                 BIT(11)      /*!< wakeup method in mute mode */
#define USART_CTL0_WL                 BIT(12)      /*!< word length */
#define USART_CTL0_MEN                BIT(13)      /*!< mute mode enable */
#define USART_CTL0_AMIE               BIT(14)      /*!< address match interrupt enable */
#define USART_CTL0_OVSMOD             BIT(15)      /*!< oversample mode */
#define USART_CTL0_DED                BITS(16,20)  /*!< driver enable deassertion time */
#define USART_CTL0_DEA                BITS(21,25)  /*!< driver enable assertion time */
#define USART_CTL0_RTIE               BIT(26)      /*!< receiver timeout interrupt enable */
#define USART_CTL0_EBIE               BIT(27)      /*!< end of block interrupt enable */

/* USARTx_CTL1 */
#define USART_CTL1_ADDM               BIT(4)       /*!< address detection mode */
#define USART_CTL1_LBLEN              BIT(5)       /*!< LIN break frame length */
#define USART_CTL1_LBDIE              BIT(6)       /*!< LIN break detection interrupt enable */
#define USART_CTL1_CLEN               BIT(8)       /*!< last bit clock pulse */
#define USART_CTL1_CPH                BIT(9)       /*!< clock phase */
#define USART_CTL1_CPL                BIT(10)      /*!< clock polarity */
#define USART_CTL1_CKEN               BIT(11)      /*!< ck pin enable */
#define USART_CTL1_STB                BITS(12,13)  /*!< stop bits length */
#define USART_CTL1_LMEN               BIT(14)      /*!< LIN mode enable */
#define USART_CTL1_STRP               BIT(15)      /*!< swap TX/RX pins */
#define USART_CTL1_RINV               BIT(16)      /*!< RX pin level inversion */
#define USART_CTL1_TINV               BIT(17)      /*!< TX pin level inversion */
#define USART_CTL1_DINV               BIT(18)      /*!< data bit level inversion */
#define USART_CTL1_MSBF               BIT(19)      /*!< most significant bit first */
#define USART_CTL1_ABDEN              BIT(20)      /*!< auto baud rate enable */
#define USART_CTL1_ABDM               BITS(21,22)  /*!< auto baud rate mode */
#define USART_CTL1_RTEN               BIT(23)      /*!< receiver timeout enable */
#define USART_CTL1_ADDR               BITS(24,31)  /*!< address of the USART terminal */

/* USARTx_CTL2  */
#define USART_CTL2_ERRIE              BIT(0)       /*!< error interrupt enable in multibuffer communication */
#define USART_CTL2_IREN               BIT(1)       /*!< IrDA mode enable */
#define USART_CTL2_IRLP               BIT(2)       /*!< IrDA low-power */
#define USART_CTL2_HDEN               BIT(3)       /*!< half-duplex enable */
#define USART_CTL2_NKEN               BIT(4)       /*!< NACK enable in smartcard mode */
#define USART_CTL2_SCEN               BIT(5)       /*!< smartcard mode enable */
#define USART_CTL2_DENR               BIT(6)       /*!< DMA enable for reception */
#define USART_CTL2_DENT               BIT(7)       /*!< DMA enable for transmission */
#define USART_CTL2_RTSEN              BIT(8)       /*!< RTS enable */
#define USART_CTL2_CTSEN              BIT(9)       /*!< CTS enable */
#define USART_CTL2_CTSIE              BIT(10)      /*!< CTS interrupt enable */
#define USART_CTL2_OSB                BIT(11)      /*!< one sample bit mode */
#define USART_CTL2_OVRD               BIT(12)      /*!< overrun disable */
#define USART_CTL2_DDRE               BIT(13)      /*!< disable DMA on reception error */
#define USART_CTL2_DEM                BIT(14)      /*!< driver enable mode */
#define USART_CTL2_DEP                BIT(15)      /*!< driver enable polarity mode */
#define USART_CTL2_SCRTNUM            BITS(17,19)  /*!< smartcard auto-retry number */
#define USART_CTL2_WUM                BITS(20,21)  /*!< wakeup mode from deep-sleep mode */
#define USART_CTL2_WUIE               BIT(22)      /*!< wakeup from deep-sleep mode interrupt enable */

